// WiFi библиотека
#include <ESP8266WiFi.h> 

//=======================================================================================
// Библиотека WEB-сервера
#include <ESP8266WebServer.h>
// Инициализация библиотеки WEB-сервера
ESP8266WebServer httpServer(80);
// Определения необходимое для работы ficon
#define ficonHttpServer httpServer
//=======================================================================================

//=======================================================================================
// Если есть необходимость в своём скетче использовать
// библиотеку для работы с SPIFFS
// 1. Можно использовать объект ficonFS и флаг ficonFSOK,
// который содержит результат инициализации;
// 2. Проинициализировать библиотеку в своей программе,
// и раскомментировать следующие строки:
// Библиотека для работы с файловой системой SPIFFS
//#include "FS.h"
// Флаг инициализации файловой системы
//static bool fsOK;
//#define ficonFS SPIFFS
//#define ficonFSOK fsOK

// Инициализация в setup должна выглядеть следующим образом:
//fsOK = SPIFFS.begin();
//=======================================================================================

void setup() {

  ficonSetup();

}

void loop() {
  // Функция необходимая для работы WEB-сервера
  httpServer.handleClient();
  delay(1);
}
